testCases/ductFlowAR1Reb3500/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2304
(
(-8.67052e-15 17.0556 0.00072446)
(-2.32675e-14 17.032 0.00215221)
(-1.59432e-14 16.9875 0.00355254)
(-7.81235e-15 16.9243 0.00493974)
(-8.82591e-15 16.8442 0.00632765)
(-8.0314e-15 16.7486 0.00773778)
(-7.25531e-15 16.6388 0.00918052)
(-5.26829e-15 16.5157 0.0106602)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
96
(
(-5.25364e-17 0.404401 0.446605)
(-8.46176e-17 0.34251 1.18771)
(-2.22284e-16 0.310877 1.87874)
(-3.69295e-16 0.290199 2.54815)
(-4.86425e-16 0.274195 3.20753)
(-6.36879e-16 0.260223 3.8617)
(-8.58399e-16 0.246859 4.5117)
(-1.02146e-15 0.233271 5.15595)
...
)
;
    }
    symPlanes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
